# 1. Train

In [1]:
import pandas as pd

In [3]:
train = pd.read_csv('../data/train.csv')

### 1. 데이터 탐색

In [4]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
train['Sex'].count()

891

In [8]:
train['Sex'].unique()

array(['male', 'female'], dtype=object)

In [9]:
train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [11]:
train[['Sex', 'Survived']].head()

      Sex  Survived
0    male         0
1  female         1
2  female         1
3  female         1
4    male         0

In [12]:
train[['Sex', 'Survived']].tail()

        Sex  Survived
886    male         0
887  female         1
888  female         0
889    male         1
890    male         0

In [15]:
train_sex = train[['Sex', 'Survived']]

In [17]:
train_sex.head()

      Sex  Survived
0    male         0
1  female         1
2  female         1
3  female         1
4    male         0

In [21]:
train_sex[train_sex['Sex'] == 'male']['Survived'].mean()

0.18890814558058924

In [22]:
train_sex[train_sex['Sex'] == 'female']['Survived'].mean()

0.7420382165605095

In [26]:
train_sex.describe()

         Survived
count  891.000000
mean     0.383838
std      0.486592
min      0.000000
25%      0.000000
50%      0.000000
75%      1.000000
max      1.000000

In [27]:
import matplotlib

In [29]:
from matplotlib import pyplot as plt

In [ ]:
!pip uninstall matplotlib

In [ ]:
!pip install matplotlib

In [35]:
train_sex.groupby('Sex').count()

        Survived
Sex
female       314
male         577

In [34]:
train_sex.groupby('Sex').sum()

        Survived
Sex
female       233
male         109

In [38]:
train_sex.groupby('Sex').mean()

        Survived
Sex
female  0.742038
male    0.188908

In [37]:
train_sex.groupby('Sex').describe()

       Survived
          count      mean       std  min  25%  50%  75%  max
Sex
female    314.0  0.742038  0.438211  0.0  0.0  1.0  1.0  1.0
male      577.0  0.188908  0.391775  0.0  0.0  0.0  0.0  1.0